chat_system_1509538723_actor_description=Master Richard. Our mentor from Knight's School.
chat_system_1509538723_snap_all_win_question=^?^So, shall we honor the winner? The champion of our tournament, the prizewinner - my best student, the valiant Knight [player].<br>By the tears of a dragon, you've made me proud, son!
chat_system_1509538723_snap_all_win_answer_0=^?^Hmm... Will I receive anything for the victory?
chat_system_1509538723_snap_4_question=^?^Sure, sure! You've defeated the dragon - take the reward.<br>I think you'll be a worthy bearer of this weapon.<br><br>[s]You've received the Dragon Slayer Sword!!![/s]
chat_system_1509538723_snap_4_answer_0=^?^Thank you. Sounds good, and I am anxious to test this weapon in action.
chat_system_1509538723_snap_win_question=^?^Well done, [player]! You have passed this stage. I'm sure that further successes await.<br>I hope that a fight with an experienced opponent not only helped show you what you are capable of, but also helped you learn something about battle tactics...<br><br>[s]You've obtained 2 Might Runes![/s]
chat_system_1509538723_snap_win_answer_0=^?^Thank you!
chat_system_1509538723_snap_0_question=^?^So [player], how do you like serving the king? Oh, and, by the way, thank you for finding my lost boot...
chat_system_1509538723_snap_0_answer_0=^?^But why me? As I understand, you decided long ago that I was to be the man who received the title of royal searcher.
chat_system_1509538723_snap_2_question=^?^Call it flair or intuition, or whatever you like. You are a smart guy, [player], one of my best students. Maybe not the best, but your potential is great.<br>Besides, when His Majesty asked me to find a smart young man among our graduates for that position - well, I don't know why, but I thought of you immediately. You're a good man, resourceful. I hope you don't regret taking the position?
chat_system_1509538723_snap_2_answer_0=^?^Yes, everything's good. I like the job. Our king is strict, of course, but probably that's the only way to maintain control.
chat_system_1509538723_snap_2_header_0=^?^That's fine! I hope it does not disappoint you how I decided your fate.
chat_system_1509538723_snap_1_question=^?^Good day [player]... What... did you miss your peevish mentor, and his hard hand?
chat_system_1509538723_snap_1_answer_0=^?^I'd like to try my hand in a tournament.
chat_system_1509538723_snap_1_answer_1=^?^What happened to the previous searcher?
chat_system_1509538723_snap_1_header_1=^?^His name was de'Virre.... He was a good warrior, and a talented searcher. But it was not only treasures he sought, but clues and various secrets. The more ancient and dangerous the secret, the more aggressively he pounced upon it. In the end, he must have run up against something that was too difficult for him.
chat_system_1509538723_snap_1_answer_2=^?^I was happy to see you, but I have to go now.
chat_system_1509538723_snap_3_question=^?^In a tournament? Well, of course. If the rules are unfamiliar to you, I can tell you. If you know everything, then go, choose your opponent and proceed to your victory. I do hope you win...<br><br>But remember, this is no training combat, but a real one. It will end with the death of one of the participants.
chat_system_1509538723_snap_3_answer_0=^?^Tell me the rules.
chat_system_1509538723_snap_3_header_0=^?^The rules are simple. Along your way, you must defeat several opponents. With every victory your next opponent will be stronger and stronger.<br>The last and most difficult fight will determine who will win the prize of the tournament - an extremely precious artifact! And not only is it precious, but also extremely useful!
chat_system_1509538723_snap_3_answer_1=^?^Fight Adun Goblin. [s](level 3)[/s]
chat_system_1509538723_snap_3_answer_2=^?^[s]Fight Robin of Greenwood! [s](level 6)[/s]
chat_system_1509538723_snap_3_answer_3=^?^Fight Robin of Greenwood! [s](level 6)[/s]
chat_system_1509538723_snap_3_answer_4=^?^[s]Fight the Gorgon Medusa! (level 10)[/s]
chat_system_1509538723_snap_3_answer_5=^?^Fight with the Gorgon Medusa! [s](level 10)[/s]
chat_system_1509538723_snap_3_answer_6=^?^[s]Fight Big Pato! (level 15)[/s]
chat_system_1509538723_snap_3_answer_7=^?^Fight Big Pato! [s](level 15)[/s]
chat_system_1509538723_snap_3_answer_8=^?^[s]Fight Dreddho Dragon! [s](level 30)[/s]
chat_system_1509538723_snap_3_answer_9=^?^Fight Dreddho Dragon! [s](level 30)[/s]
chat_system_1509538723_snap_3_answer_10=^?^Perhaps next time...
chat_system_1509538723_switch_3_header_0=^?^I'm sorry [player], but the rules are quite strict. To fight a more worthy opponent, you must defeat weaker enemies.
chat_system_1509538723_snap_5_question=^?^This will be the final battle, and your opponent will be unusually strong. Are you ready for the final fight?
chat_system_1509538723_snap_5_answer_0=^?^Yes, I'm ready.
chat_system_1509538723_snap_5_answer_1=^?^No, not yet.
chat_system_1509538723_snap_5_header_1=^?^Well, reasonable caution is always commendable. Come back when you're ready.
